In [1]:
import numpy as np
import pandas as pd

animals = pd.read_csv('./data/animals.csv')

print(animals.index.values) # get index values

animals[0:7] # get first 7 rows

[ 0  1  2  3  4  5  6  7  8  9 10 11 12 13 14 15 16 17 18 19 20 21 22 23
 24 25 26 27 28 29 30 31 32 33 34 35 36 37 38 39 40 41 42 43 44 45 46 47
 48 49 50 51 52 53 54 55 56 57 58 59 60 61]

   brainwt   bodywt      animal
0    3.385   44.500  Arctic_fox
1    0.480   15.499  Owl_monkey
2    1.350    8.100      Beaver
3  464.983  423.012         Cow
4   36.328  119.498   Gray_wolf
5   27.660  114.996        Goat
6   14.831   98.199    Roe_deer

In [2]:
# Get first 5 values from column in dataframe
animals['bodywt'][0:5]

0     44.500
1     15.499
2      8.100
3    423.012
4    119.498
Name: bodywt, dtype: float64

In [3]:
#calling the bodywt column as an attribute of the DataFrame:
animals.bodywt[0:5]

0     44.500
1     15.499
2      8.100
3    423.012
4    119.498
Name: bodywt, dtype: float64

In [4]:
# How to get subset of data with iloc
animals.iloc[5:10, 0:2] # rows 5-9 in columns 0-1

   brainwt   bodywt
5   27.660  114.996
6   14.831   98.199
7    1.040    5.500
8    4.190   57.998
9    0.425    6.400

In [5]:
# Get set of rows from given column with 'loc'
animals.loc[2:6, 'bodywt']

2      8.100
3    423.012
4    119.498
5    114.996
6     98.199
Name: bodywt, dtype: float64

In [6]:
# Get subset of dataframe with 'loc' by given columns
animals.loc[1:4, ['bodywt', 'brainwt']]

    bodywt  brainwt
1   15.499    0.480
2    8.100    1.350
3  423.012  464.983
4  119.498   36.328

In [7]:
# How to filter results from a dataframe
animals[animals.bodywt < 2]

    brainwt  bodywt                     animal
13    0.005    0.14  Lesser_short-tailed-shrew
14    0.060    1.00            Star-nosed_mole
19    0.023    0.30              Big_brown_bat
37    0.120    1.00             Golden_hamster
38    0.023    0.40                      Mouse
39    0.010    0.25           Little_brown_bat
51    0.280    1.90                        Rat
52    0.075    1.20           E._American_mole
54    0.048    0.33                 Musk_shrew

In [8]:
animals[animals.bodywt > 25 * animals.brainwt]

    brainwt   bodywt                     animal
1     0.480   15.499                 Owl_monkey
10    0.101    4.000            Ground_squirrel
13    0.005    0.140  Lesser_short-tailed-shrew
34    6.800  179.003              Rhesus_monkey

In [9]:
animals[animals.bodywt > 25 * animals.brainwt]['animal']

1                    Owl_monkey
10              Ground_squirrel
13    Lesser_short-tailed-shrew
34                Rhesus_monkey
Name: animal, dtype: object